### 第三章 HTTP报文
**用于HTTP协议交互的信息被称为HTTP报文**。请求端（客户端）的HTTP报文叫做请求报文，响应端（服务器端）的叫做响应报文。HTTP报文本身是由多行（用CR+LF作换行符）数据构成的字符串文本。

HTTP报文大致可分为报文首部和报文主体两块。两者由最初出现的空行（CR+LF）来划分。通常，并不一定要有报文主体。

---

请求报文和响应报文的首部内容由以下数据组成：

- 请求行：包含用于请求的方法，请求URI和HTTP版本。
- 状态行：包含表明响应结果的状态码，原因短语和HTTP版本。
- 首部字段：包含表示请求和响应的各种条件和属性的各类首部。一般有4种首部，分别是：通用首部、请求首部、响应首部和实体首部。
- 其他：可能包含HTTP的RFC里未定义的首部（Cookie等）。

---

HTTP在传输数据时可以按照数据原貌直接传输，但也可以在传输过程中通过编码提升传输速率。

---

HTTP协议中采纳了多部分对象集合，发送的一份报文主体内可含有多类型实体。通常是在图片或文本文件等上传时使用。

在HTTP报文中使用多部分对象集合时，需要在首部字段里加上Content-type。

---

内容协商机制是指客户端和服务器端就响应的资源内容进行交涉，然后提供给客户端最为适合的资源。内容协商会以响应资源的语言、字符集、编码方式等作为判断的基准。

包含在请求报文中的某些首部字段（如下）就是判断的基准。

- Accept
- Accept-Charset
- Accept-Encoding
- Accept-Language
- Content-Language
